app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Jun 2013 10:24:22 UTC +00:00], ["name", "Cafes & Bars"], ["updated_at", Tue, 18 Jun 2013 10:24:22 UTC +00:00]]