app/controllers/cities_controller.rb

  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Jun 2013 10:25:53 UTC +00:00], ["name", "Berlin"], ["updated_at", Tue, 18 Jun 2013 10:25:53 UTC +00:00]]