app/controllers/cuisines_controller.rb

SELECT "cuisines".* FROM "cuisines"
---
  def index
    @cuisines = Cuisine.all

SELECT "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cuisine = Cuisine.find(params[:id])

INSERT INTO "cuisines" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Jun 2013 10:27:00 UTC +00:00], ["name", "Italian"], ["updated_at", Tue, 18 Jun 2013 10:27:00 UTC +00:00]]
---
  def create
    @cuisine = Cuisine.new(params[:cuisine])

    respond_to do |format|
      if @cuisine.save