app/controllers/hackathons_controller.rb

SELECT "hackathons".* FROM "hackathons"
---
  def index
    @hackathons = Hackathon.all

SELECT "hackathons".* FROM "hackathons" WHERE "hackathons"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @hackathon = Hackathon.find(params[:id])

INSERT INTO "hackathons" ("city", "created_at", "date", "info", "name", "updated_at", "where") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @hackathon = Hackathon.new(params[:hackathon])

    respond_to do |format|
      if @hackathon.save