app/controllers/places_controller.rb

  def show
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @place = Place.new(params[:place])
    #String processing the text number into a pure number
    input_num = @place.phone
    @place.phone = input_num.to_s.gsub(/[^0-9]/, '') if input_num
   # flash[:notice] = "Added your Vegan Place successfully"
    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("address", "category_id", "city_id", "created_at", "cuisine_id", "description", "name", "phone", "picture", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)