app/controllers/search_controller.rb

SELECT "cuisines".* FROM "cuisines" WHERE (name LIKE '%itali%') LIMIT 1
SELECT COUNT(*) FROM "cuisines" WHERE (name LIKE '%%')
SELECT "places".* FROM "places" WHERE (name LIKE '%India%' OR description LIKE'%India%' OR address LIKE'%India%' OR cuisine_id =2) ORDER BY "places"."id" DESC LIMIT 1
---
  def find
    #method to process the SQL Query


    search_name = "%#{params[:place][:name]}%"

    search_cuisine = Cuisine.where("name LIKE ?", search_name)

    search_city = City.where("name LIKE?", search_name)


    unless search_cuisine.empty?
      search_cuisine_id = search_cuisine.first.id
    end


    unless search_city.empty?

      search_city_id = search_city.first.id
    end

    @places = Place.where("name LIKE ? OR description LIKE? OR address LIKE? OR cuisine_id =? OR city_id=?",search_name,search_name,search_name,search_cuisine_id,search_city_id)