app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 18 Jun 2013 14:40:34 UTC +00:00], ["email", "test"], ["name", "test"], ["password", "test"], ["updated_at", Tue, 18 Jun 2013 14:40:34 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save