app/views/places/_form.html.erb

SELECT "cities".* FROM "cities"
---
          <%= f.label :city_id %><br />
          <%= f.collection_select :city_id, City.all, :id, :name, {},{:class=>'button secondary my_light_button'} %>

SELECT "categories".* FROM "categories"
---
          <%= f.label :category_id %><br />
             <%= f.collection_select :category_id, Category.all, :id, :name, {},{:class=>'button secondary'} %>

SELECT "cuisines".* FROM "cuisines"
---
          <%= f.label :cuisine_id %><br />
          <%= f.collection_select :cuisine_id, Cuisine.all, :id, :name, {},{:class=>'button secondary '} %>